In [1]:
import pandas as pd

In [2]:
# dataframs with one common column
employees = pd.DataFrame({
    'Name':['Ramesh', 'Suresh', 'Mahesh'],
    'join_date': ['2025-09-08', '2025-06-19', '2025-06-29'],
    'Dept_id':[10, 20, 30]
})
department = pd.DataFrame({
    'Dept_id': [10,20,40],
    'Department': ['IT', 'HR', 'Sales']
})

# dataframes with one and only common column
v1 = pd.DataFrame({'Name':['Ram','Shyam']})
v2 = pd.DataFrame({'Name':['Krishna','Bheem']})

# dataframes with one common column only
v3 = pd.DataFrame({'Name':['Ram','Shyam'], 'Score':[879,912]})
v4 = pd.DataFrame({'Name':['Krishna','Bheem'], 'Age':[19,18]})

In [3]:
employees

     Name   join_date  Dept_id
0  Ramesh  2025-09-08       10
1  Suresh  2025-06-19       20
2  Mahesh  2025-06-29       30

In [4]:
department

   Dept_id Department
0       10         IT
1       20         HR
2       40      Sales

In [5]:
v1

    Name
0    Ram
1  Shyam

In [6]:
v2

      Name
0  Krishna
1    Bheem

In [7]:
v3

    Name  Score
0    Ram    879
1  Shyam    912

In [8]:
v4

      Name  Age
0  Krishna   19
1    Bheem   18

## Merge

In [9]:
pd.merge(employees, department, on='Dept_id')
# you can see no values for 30 and 40

     Name   join_date  Dept_id Department
0  Ramesh  2025-09-08       10         IT
1  Suresh  2025-06-19       20         HR

In [10]:
# if we want all ids from employees (i.e. on left side) then we'll use how='left'
pd.merge(employees, department, on='Dept_id', how='left')
# you can NaN in department column because it has now values so pandas has to justify it by NaN

     Name   join_date  Dept_id Department
0  Ramesh  2025-09-08       10         IT
1  Suresh  2025-06-19       20         HR
2  Mahesh  2025-06-29       30        NaN

In [11]:
# if we want all ids from department (i.e. on right side) then we'll use how='right'
pd.merge(employees, department, on='Dept_id', how='right')
# you can NaN in name and join date column because it has now values so pandas has to justify it by NaN

     Name   join_date  Dept_id Department
0  Ramesh  2025-09-08       10         IT
1  Suresh  2025-06-19       20         HR
2     NaN         NaN       40      Sales

In [12]:
# if we want all ids from both employees and department (i.e. on both side) then we'll use how='outer'
pd.merge(employees, department, on='Dept_id', how='outer')

     Name   join_date  Dept_id Department
0  Ramesh  2025-09-08       10         IT
1  Suresh  2025-06-19       20         HR
2  Mahesh  2025-06-29       30        NaN
3     NaN         NaN       40      Sales

## Joining or Concatinate

In [13]:
pd.concat([v1,v2]) # default axies is 0

      Name
0      Ram
1    Shyam
0  Krishna
1    Bheem

In [14]:
pd.concat([v1,v2], axis=1)

    Name     Name
0    Ram  Krishna
1  Shyam    Bheem

In [15]:
pd.concat([v3,v4])

      Name  Score   Age
0      Ram  879.0   NaN
1    Shyam  912.0   NaN
0  Krishna    NaN  19.0
1    Bheem    NaN  18.0

In [16]:
pd.concat([v3,v4], axis=1)

    Name  Score     Name  Age
0    Ram    879  Krishna   19
1  Shyam    912    Bheem   18